Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

read_csv(): This function is used to read data from a CSV file and create a DataFrame.

head(): This function is used to display the first n rows of a DataFrame.

groupby(): This function is used to group a DataFrame by one or more columns and apply a function to each group.

pivot_table(): This function is used to create a pivot table from a DataFrame.

to_csv(): This function is used to write a DataFrame to a CSV file.

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
df = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [5]:
def reindex_df(df):
    # Create a new index that starts from 1 and increments by 2 for each row
    new_index = pd.RangeIndex(start=1, stop=2*len(df), step=2)

    # Assign the new index to the DataFrame
    df.index = new_index

    # Return the re-indexed DataFrame
    return df

In [10]:
# Create a sample DataFrame
df1 = pd.DataFrame(df)

# Print the original DataFrame
print("Original DataFrame:")
print(df1)

# Re-index the DataFrame using the reindex_df() function
df_reindexed = reindex_df(df1)

# Print the re-indexed DataFrame
print("Re-indexed DataFrame:")
print(df_reindexed)

Original DataFrame:
   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
Re-indexed DataFrame:
   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [16]:
df2 = {'Values': [10, 20, 30, 40, 50]}
def calculate_sum(df2):
    # Initialize a variable to store the sum
    total_sum = 0

    # Iterate over the first three rows of the 'Values' column
    for value in df['Values'].iloc[:3]:
        # Add each value to the total sum
        total_sum += value

    # Print the total sum to the console
    print("The sum of the first three values in the 'Values' column is:", total_sum)

In [17]:
df = pd.DataFrame(df2)

# Call the calculate_sum() function on the DataFrame
calculate_sum(df)

The sum of the first three values in the 'Values' column is: 60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [20]:
pd.set_option("display.max_colwidth",1000)
df3 = pd.DataFrame({'Desc' :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","my name is chandan", "i usee to learn data science master"]})

In [21]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            Desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             my name is chandan
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            i usee to learn data science master

In [22]:
df3['word_count'] = df3['Desc'].apply(lambda x : len(x.split()))

In [23]:
df3

,Desc,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",104
1,my name is chandan,4
2,i usee to learn data science master,7

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [24]:
# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Get the size of the DataFrame
size = df.size

# Get the shape of the DataFrame
shape = df.shape

In [25]:
size

6

In [26]:
shape

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

df = pd.read_excel('examplename.xlsx')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [32]:
# create a sample DataFrame
df1 = pd.DataFrame({'Email': ['john.doe@example.com', 'jane.doe@example.com', 'bob.smith@example.com']})

# create a new 'Username' column containing the username part of each email address
df1['Username'] = df1['Email'].apply(lambda x: x.split('@')[0])

In [33]:
df1

                   Email   Username
0   john.doe@example.com   john.doe
1   jane.doe@example.com   jane.doe
2  bob.smith@example.com  bob.smith

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:


     A B C
   0 3 5 1
   1 8 2 7
   2 6 9 4
   3 2 3 5
   4 9 1 2


Your function should select the following rows: A B C
1 8 2 7
4 9 1 2



The function should return a new DataFrame that contains only the selected rows.

In [2]:
df4 = ({'A':[3,8,6,2,9],
       'B':[5,2,9,3,1],
       'C':[1,7,4,5,2]})

In [3]:
df5 = pd.DataFrame(df4)

In [4]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [8]:
df5[1:5:3]

   A  B  C
1  8  2  7
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [12]:
d = {'a':[1,2,3,4],
       'b':[4,5,6,7],
       'c':["chandan","aayush","hitesh","navin"]}

In [13]:
d1 = pd.DataFrame(d)

In [14]:
d1

   a  b        c
0  1  4  chandan
1  2  5   aayush
2  3  6   hitesh
3  4  7    navin

In [15]:
d1['a'].mean()

2.5

In [16]:
d1['a'].median()

2.5

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [23]:
df = {'Sales':[10, 15, 20, 30, 25, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80],
     'Date':['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12', '2023-01-13', '2023-01-14', '2023-01-15']}

In [24]:
df1 = pd.DataFrame(df)

In [26]:
df1['Average'] = df1['Sales'].rolling(window=7, min_periods=1).mean()

In [27]:
df1

    Sales        Date    Average
0      10  2023-01-01  10.000000
1      15  2023-01-02  12.500000
2      20  2023-01-03  15.000000
3      30  2023-01-04  18.750000
4      25  2023-01-05  20.000000
5      35  2023-01-06  22.500000
6      40  2023-01-07  25.000000
7      45  2023-01-08  30.000000
8      50  2023-01-09  35.000000
9      55  2023-01-10  40.000000
10     60  2023-01-11  44.285714
11     65  2023-01-12  50.000000
12     70  2023-01-13  55.000000
13     75  2023-01-14  60.000000
14     80  2023-01-15  65.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:
  Date       Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [43]:
df4 = ({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05'],
       'Weekday':['Sunday','Monday','Tuesday','Wednesday','Thursday']})

In [44]:
df5 = pd.DataFrame(df4)

In [46]:
df5

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [49]:
# Python Pandas - Data Functionality

date = pd.date_range(start='2023-01-01', end = '2023-01-31')

In [50]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df_date = pd.DataFrame(date)

In [52]:
df_date

            0
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself.

import pandas as pd